import { CustomButton } from "../../_shared/Button/Button";
import { CustomTypography } from "../../_shared/Typography/Typography";

export const AboutPark = () => {
  return (
    <div className="bg-white drop-shadow-2xl rounded-[26px] pt-[15px] pr-[19px] pb-[12px] pl-[34px] w-[817px]">
      <div className="flex justify-between border-b-[1px] text-xl leading-4">
        <div>
          <CustomTypography className="mb-[34px]">Адрес парка</CustomTypography>
          <CustomTypography className="flex items-center text-[#47B1FE]">
            <svg
              width="20"
              height="20"
              viewBox="0 0 20 20"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
              className="mr-[10px]"
            >
              <g clip-path="url(#clip0_76_29)">
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M14.6288 13.423C14.8113 13.3317 15.021 13.3105 15.218 13.3635C15.4151 13.4165 15.5859 13.54 15.698 13.7105L15.7463 13.7955L17.413 17.1288C17.4724 17.2477 17.5026 17.379 17.5009 17.512C17.4993 17.6449 17.4659 17.7754 17.4035 17.8928C17.3411 18.0102 17.2515 18.1109 17.1423 18.1866C17.033 18.2623 16.9073 18.3108 16.7755 18.328L16.668 18.3346H3.33462C3.20168 18.3347 3.07066 18.3029 2.9525 18.242C2.83433 18.1811 2.73246 18.0928 2.65538 17.9845C2.5783 17.8761 2.52826 17.751 2.50943 17.6194C2.49059 17.4878 2.50352 17.3536 2.54712 17.228L2.58879 17.128L4.25546 13.7946C4.34887 13.6015 4.51314 13.4519 4.71409 13.3769C4.91503 13.3018 5.13717 13.3072 5.33428 13.3918C5.53139 13.4764 5.68829 13.6337 5.77233 13.8311C5.85636 14.0284 5.86107 14.2506 5.78546 14.4513L5.74629 14.5405L4.68296 16.668H15.3196L14.2563 14.5405C14.1576 14.3429 14.1414 14.1142 14.2113 13.9046C14.2811 13.6951 14.4313 13.5218 14.6288 13.423ZM10.0013 1.66797C11.5484 1.66797 13.0321 2.28255 14.1261 3.37651C15.22 4.47047 15.8346 5.95421 15.8346 7.5013C15.8346 9.4863 14.7605 11.0988 13.6488 12.243C13.0347 12.8667 12.3597 13.4272 11.6338 13.9163L11.323 14.1213L11.0463 14.2955C11.003 14.3213 10.9613 14.3455 10.9221 14.3705L10.708 14.4938C10.268 14.7438 9.73462 14.7438 9.29462 14.4938L9.08046 14.3696L8.82212 14.2121C8.77444 14.1821 8.72694 14.1519 8.67962 14.1213L8.36879 13.9163C7.64291 13.4272 6.96787 12.8667 6.35379 12.243C5.24212 11.0988 4.16796 9.4863 4.16796 7.5013C4.16796 5.95421 4.78254 4.47047 5.8765 3.37651C6.97046 2.28255 8.45419 1.66797 10.0013 1.66797ZM10.0013 5.83464C9.55926 5.83464 9.13534 6.01023 8.82278 6.32279C8.51022 6.63535 8.33462 7.05927 8.33462 7.5013C8.33462 7.94333 8.51022 8.36725 8.82278 8.67981C9.13534 8.99237 9.55926 9.16797 10.0013 9.16797C10.4433 9.16797 10.8672 8.99237 11.1798 8.67981C11.4924 8.36725 11.668 7.94333 11.668 7.5013C11.668 7.05927 11.4924 6.63535 11.1798 6.32279C10.8672 6.01023 10.4433 5.83464 10.0013 5.83464Z"
                  fill="black"
                />
              </g>
              <defs>
                <clipPath id="clip0_76_29">
                  <rect width="20" height="20" fill="white" />
                </clipPath>
              </defs>
            </svg>
            Москва, ул. Поморская 15с1, 127410
          </CustomTypography>
        </div>
        <div className="mb-[18px] flex flex-col items-end">
          <CustomTypography className=" mb-[34px]">
            График работы
          </CustomTypography>
          <CustomTypography className="flex items-center mb-[10px]">
            <svg
              width="18"
              height="18"
              viewBox="0 0 18 18"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
              className="mr-[6px]"
            >
              <path
                d="M9 0C4.02891 0 0 4.02891 0 9C0 13.9711 4.02891 18 9 18C13.9711 18 18 13.9711 18 9C18 4.02891 13.9711 0 9 0ZM9 16.4988C4.85859 16.4988 1.50117 13.1414 1.50117 9C1.50117 4.85859 4.85859 1.50117 9 1.50117C13.1414 1.50117 16.4988 4.85859 16.4988 9C16.4988 13.1414 13.1414 16.4988 9 16.4988ZM8.25117 8.25117H4.5V9.75234H9.74883V3.00234H8.24766V8.25117H8.25117Z"
                fill="black"
              />
            </svg>
            Пн - Пт: 10:00 - 22:00
          </CustomTypography>
          <CustomTypography>Сб - Вс: выходной</CustomTypography>
        </div>
      </div>
      <div className="border-b-[1px] py-[20px] text-xl leading-4">
        <CustomTypography className=" mb-[34px]">Телефон</CustomTypography>
        <CustomTypography>+7(999) 123-45-67</CustomTypography>
      </div>
      <div className="border-b-[1px] py-[20px] flex justify-between text-xl leading-4">
        <CustomTypography className="">О парке</CustomTypography>
        <svg
          width="28"
          height="12"
          viewBox="0 0 28 12"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M11.86 11.4457C11.7453 11.4471 11.6315 11.4249 11.526 11.3806C11.4206 11.3363 11.3257 11.2709 11.2476 11.1886L3.37358 3.47429C3.02362 3.13143 3.02362 2.6 3.37358 2.25714C3.72353 1.91429 4.26597 1.91429 4.61592 2.25714L11.8775 9.37143L19.1216 2.27429C19.4716 1.93143 20.014 1.93143 20.364 2.27429C20.7139 2.61714 20.7139 3.14857 20.364 3.49143L12.4899 11.2057C12.315 11.3771 12.0875 11.4629 11.8775 11.4629L11.86 11.4457Z"
            fill="black"
          />
        </svg>
      </div>
      <div className="pt-[12px] flex justify-end">
        <CustomButton className="bg-[#FDE000] rounded-[8px] max-w-[255px] px-[40px] py-[10px] text-xl leading-5">
          Смотреть похожие
        </CustomButton>
      </div>
    </div>
  );
};
